In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data.csv")

df

  Name  Subject  Score
0    A    Maths     45
1    B    Maths     40
2    A  Science     41
3    C    Maths     47
4    B  Science     43
5    C  Science     42

In [3]:
df.pivot(index="Name", columns = "Subject", values = "Score")

Subject  Maths  Science
Name
A           45       41
B           40       43
C           47       42